"use client";

import {
  SelectedProduct,
  setCart,
  totalSelectedProduct,
} from "@/redux/features/cartSlice";
import Link from "next/link";
import { useRouter } from "next/navigation";
import { useEffect, useState } from "react";
import { useSelector } from "react-redux";
import { useSession } from "next-auth/react";
import { ProductState } from "@/types";

function Contract() {
  const { push } = useRouter();
  const totalselect = useSelector(totalSelectedProduct);
  const { data: session } = useSession();
  const selectedProduct = useSelector(SelectedProduct);
  const [owner,setOwner] = useState <ProductState|null> (null)

  const getData = async () => {
    const res = await fetch(`/api/services/products/${selectedProduct?.productid}`);
    const data = await res.json();
    setOwner(data)
  }
  useEffect(() => {
    if (totalselect != 1) {
      push("/checkout/cart");
    }
    getData()
  }, []);

  return (
    <div className="px-[5%]">
      <div className="flex flex-col lg:w-[60%] gap-2 ">
        <div className="font-bold text-slate-400">Pick up point</div>
        <div className="w-full h-0 border boerder-slate-400"></div>
        <div className="w-full flex items-center gap-6 p-6">
          <svg
            width="40"
            height="46"
            viewBox="0 0 40 46"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            className="w-20"
          >
            <path
              d="M32.7281 32.7281C30.6205 34.8354 26.2136 39.2423 23.1811 42.2748C21.4236 44.0323 18.5774 44.0332 16.8199 42.2757C13.8403 39.2961 9.51859 34.9745 7.2721 32.7281C0.242635 25.6986 0.242635 14.3015 7.2721 7.2721C14.3015 0.242635 25.6986 0.242635 32.7281 7.2721C39.7573 14.3015 39.7573 25.6986 32.7281 32.7281Z"
              stroke="#4A5568"
              strokeWidth="3"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
            <path
              d="M26.75 20C26.75 23.728 23.728 26.75 20 26.75C16.272 26.75 13.25 23.728 13.25 20C13.25 16.2721 16.272 13.25 20 13.25C23.728 13.25 26.75 16.2721 26.75 20Z"
              stroke="#4A5568"
              strokeWidth="3"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
          </svg>
          <div className="flex flex-col">
            <div className="font-bold text-slate-700">
              {selectedProduct?.location}
            </div>
            <div className="self-end font-bold text-slate-400">
              Open in Google Map
            </div>
          </div>
        </div>
        <div className="w-full h-0 border boerder-slate-400"></div>
        <div className="font-bold text-slate-400">Contract</div>
        <div className="font-bold text-slate-800">
          แบบสัญญา
          <br />
          <br />
          สัญญาเชาคอมพิวเตอร์
          <br />
          <br />
          สัญญาฉบับนี้ทำขึ้นระหว่าง
          <br />
          <br />
          เมื่อวันที่ {session?.expires.slice(0,10)} โดย {session?.user.name + " "}
          ซึ่งต่อไปนี้สัญญานี้เรียกว่า ผู้เช่า ฝ่ายหนึ่ง กับ {owner?.owner.firstName} ซึ่งต่อไปในสัญญานี้เรียกว่า ผู้ให้เช่า อีกฝ่ายหนึ่ง
          <br />
          <br />
          คู่สัญญาได้ตกลงกันมีข้อความดังต่อไปนี้
          <br />
          <br />
          ข้อ ๑ คำนิยาม
          <br />
          <br />
          ค่าเช่า หมายความรวมถึง ค่าบำรุงรักษาด้วย ค่าบำรุงรักษา
          หมายความรวมถึง ค่าใช้จ่ายทั้งสิ้นในการบำรุงรักษาและซ่อมแชมแก้ไข
          การบำรุงรักษา หมายความรวมถึง
          การตรวจสอบตามกำหนดเวลาตลอดจนการช่อมแชม
          แก้ไขและเปลี่ยนแปลงส่วนประกอบที่เกี่ยวกับคอมพิวเตอร์ที่เช่าเพื่อให้ใช้งานได้อย่างทันสมัยเป็นปกติและมีประสิทธิภาพตลอดระยะเวลาของการเช่า
          การซ่อมแชมแก้ไข หมายความรวมถึง
          การช่อมแชมแก้ไขไม่ว่าจะเป็นการซ่อมแชมแก้ไขเล็กน้อยหรือไม่
          <br />
          <br />
          ข้อ ๒ ข้อตกลงเช่า
          <br />
          <br />
          ผู้เช่าตกลงเช่าและให้ผู้เช่าตกลงให้เช่าเครื่องคอมพิวเตอร์ (Hardware)
          ชอฟท์แวร์ (Software) อุปกรณ์ประมวลผลระบบคอมพิวเตอร์
          โปรแกรมประยุกต์การให้บริการ อุปกรณ์ประกอบระบบ (ชื่อระบบปฏิบัติการ)
          รวมทั้งส่วนประกอบอื่นๆ ที่สามารถรับโปรแกรม ข้อมูล ประมวลผลสื่อสาร
          เคลื่อนย้ายข้อมูล และแสดงผลลัพธ์ได้
          ซึ่งเป็นผลิตภัณฑ์ของซึ่งต่อไปในสัญญานี้เรียกว่า คอมพิวเตอร์
          <br />
          <br />
          ข้อ ๓ ระยะเวลาการเช่า
          <br />
          <br />
          สัญญานี้มีผลบังคับตั้งแต่วันที่ลงนามในสัญญา ตั้งแต่วันที่ (xx-xx)
          <br />
          <br />
          ข้อ ๔ การชำระค่าเช่า
          <br />
          <br />
          ผู้เช่าจะต้องชำระค่าเช่าล่วงหน้าผ่านระบบเท่านั้น
          <br />
          <br />
          ข้อ ๕ การบำรุงรักษา
          <br />
          <br />
          ผู้ให้เช่ามีหน้าที่บำรุงรักษาคอมพิวเตอร์ให้อยู่ในสภาพใช้งานได้ดีอยู่เสมอ
          รวมทั้งปรับปรุงพัฒนาระบบคอมพิวเตอร์ให้ทันสมัยเป็นปัจจุบันและมีประสิทธิภาพตามความต้องการใช้งานของผู้เช่า
          ด้วยค่าใช้จ่ายของให้เช่า
          <br />
          <br />
          ข้อ ๖ การใช้ประโยชน์
          <br />
          <br />
          การใช้ประโยชน์ในคอมพิวเตอร์ตามสัญญานี้
          ผู้ให้เช่ายินยอมให้อยู่ภายใต้การจัดการและการควบคุมดูแลของผู้เช่าโดยสิ้นเชิง
          นอกจากผู้เช่าจะใช้ในการปฏิบัติงานของผู้เช่าแล้ว
          ผู้เช่าอาจให้ผู้อื่นมาใช้ คอมพิวเตอร์นี้ได้
          โดยอยู่ภายใต้การควบคุมดูแลของผู้เช่า
          <br />
          <br />
          ข้อ ๗ ข้อตกลงการใช้โปรแกรม
          <br />
          <br />
          ผู้ให้เช่ายินยอมปฏิบัติตามข้อตกลงการใช้โปรแกรมตามที่กำหนดไว้ -
          ผู้ให้เช่าต้องดำเนินการให้ผู้เช่าและผู้ที่ได้รับมอบหมายจากผู้เช่าได้รับอนุญาตตามกฎหมายจากเจ้าของลิขสิทธิ์ในการใช้และสร้างสรรค์โดยการดัดแปลง
          การรวบรวม หรือการประกอบกันเข้า จากโปรแกรมคอมพิวเตอร์ที่เช่า -
          บรรดาข้อมูลและสารสนเทศไม่ว่าในรูปแบบใดที่เก็บอยู่ในหรือที่สร้างขึ้นโดยระบบคอมพิวเตอร์รวมทั้งงานโปรแกรมคอมพิวเตอร์ที่สร้างสรรค์ขึ้นโดยผู้ให้เช่า
          หรือลูกจ้าง พนักงาน และผู้ที่ได้รับ มอบหมายจากผู้ให้เช่า
          ให้ถือว่าเป็นลิชสิทธิ์ของผู้เช่าทั้งสิ้น -
          ประโยชน์อันจะเกิดขึ้นในอนาคตจากการพัฒนา การแก้ไขเปลี่ยนแปลง
          การใช้การทำซ้ำโปรแกรมคอมพิวเตอร์
          อันเป็นงานสร้างสรรค์อันมีลิขสิทธิ์ใหม่ตามวรรคก่อน
          ซึ่งบางส่วนจะใช้ประโยชน์
          จากโปรแกรมคอมพิวเตอร์ที่เช่าอันเป็นงานสร้างสรรค์ที่ลิขสิทธิ์เติมเป็นของผู้ให้เช่า
          ทั้งลิขสิทธิ์ที่มีอยู่หรือที่อาจจะเกิดขึ้นในภายหน้า
          ซึ่งรวมถึงในกรณีที่มีชอฟต์แวร์ที่ติดตั้งมาพร้อมกับส่วนอุปกรณ์ครั้งนี้ด้วย
          ผู้ให้เช่าไม่มีสิทธิ เรียกร้องค่าใช้จ่ายใดๆ จากผู้เช่าทั้งสิ้น
          <br />
          <br />
          ห้ามมิให้ผู้ให้เช่า ลูกจ้าง ตัวแทนหรือพนักงานของผู้ให้เชาเอาไป
          เปิดเผยหรือใช้ข้อมูลและหรือสารสนเทศในระบบดังกล่าว
          หรือกระทำด้วยประการใดๆ ให้บุคคลอื่นเอาไป เปิดเผย
          หรือใช้ข้อมูลและหรือสารสนเทศในระบบตังกล่าวหรือเข้าถึงโดยมิชอบชีงระบบคอมพิวเตอร์หรือถ่วงรู้มาตรการป้องกันการเข้าถึงระบบคอมพิวเตอร์ที่จัดทำขึ้นเป็นการเฉพาะหรือกระทำด้วยประการใดโดยมิชอบด้วยวิธีการทางอิเล็กทรอนิกส์
          เพื่อตักรับไว้ซึ่งข้อมูลคอมพิวเตอร์ของผู้เช่าหรือผู้ที่เกี่ยวข้องกับผู้เช่าที่อยู่ระหว่างการส่งในระบบคอมพิวเตอร์
          โดยไม่ชอบด้วยกฎหมายหรือโดยไม่ได้รับความยินยอมเป็นหนังสือจากผู้เช่า
          หากมีการฝ่าฝืนผู้ให้เช่าต้องรับผิดชอบ
          ชดใช้ค่าเสียหายให้แก่ผู้เช่าจนเต็มจำนวน
          <br />
          <br />
          ข้อ ๘ ความรับผิดต่อความเสียหาย
          <br />
          <br />
          ผู้เช่าไม่ต้องรับผิดชอบต่อการสูญหายหรือเสียหายใด ๆ
          ที่เกิดขึ้นแก่คอมพิวเตอร์อันไม่ใช่ความผิดของผู้เช่าตลอดระยะเวลาที่คอมพิวเตอร์อยู่ในความครอบครองของผู้เช่า
          ถ้าเกิดความเสียหายขึ้นแก่คอมพิวเตอร์หรือส่วนใดส่วนหนึ่งของคอมพิวเตอร์ที่อยู่
          ในความครอบครองของผู้เช่าตามวรรคหนึ่ง
          ผู้ให้เซ่าต้องดำเนินการทุกประการตามที่จำเป็นเพื่อทำให้คอมพิวเตอร์กลับคืนสภาพที่ใช้งานได้ดีดังเดิมโดยเร็วที่สุด
          และในกรณีที่ไม่อาจดำเนินการให้คอมพิวเตอร์คืนสูสภาพที่ใช้งานได้ดีดังเดิมได้
          หรือในกรณีที่คอมพิวเตอร์สูญหาย
          ผู้ให้เช่าต้องนำคอมพิวเตอร์เครื่องใหม่ที่มีคุณภาพ
          ประสิทธิภาพและความสามารถใช้งานไม่ต่ำกว่าคอมพิวเตอร์เดิมมาติดตั้งให้แก่ผู้เช่าแทนภายใน,
          นับถัดจากวันที่ผู้ให้เช่าได้รับแจ้งจากผู้เช่า
          คอมพิวเตอร์ที่นำมาติดตั้งแทนนี้ให้ถือเป็นคอมพิวเตอร์ตามนัยแห่งสัญญานี้ด้วย
          ทั้งนี้
          ในการปฏิบัติตามสัญญาข้อนี้ผู้ให้เช่าเป็นผู้ออกค่าใช้จ่ายเองทั้งสิ้น
          <br />
          <br />
          ข้อ ๙ การบอกเลิกสัญญา
          <br />
          <br />
          เมื่อครบกำหนดติดตั้งและส่งมอบคอมพิวเตอร์ตามสัญญาแล้ว
          ถ้าผู้ให้เช่าไม่ส่งมอบและติดตั้งคอมพิวเตอร์บางรายการหรือทั้งหมดให้แก่ผู้เช่าภายใจกำหนดเวลาตามสัญญา
          หรือส่งมอบคอมพิวเตอร์ ไม่ตรงตามสัญญา หรือมีคุณสมบัติไม่ถูกต้องตามสัญญา
          หรือส่งมอบและติดตั้งแล้วเสร็จภายในกำหนดแต่ไม่สามารถใช้งานได้อย่างมีประสิทธิภาพ
          หรือใช้งานได้ไม่ครบถ้วนตามสัญญา หรือผู้ให้เช่าไม่ปฏิบัติตามสัญญา
          ข้อใดข้อหนึ่ง ผู้เช่ามีสิทธิบอกเลิกสัญญาทั้งหมดหรือแต่บางส่วนได้
          การใช้สิทธิบอกเลิกสัญญานั้นไม่กระทบสิทธิของผู้เช่าที่จะเรียกร้องค่าเสียหายจากผู้ให้เช่า
          <br />
          <br />
          ข้อ ๑๐ การนำคอมพิวเตอร์กลับคืนไป
          <br />
          <br />
          เมื่อสัญญาสิ้นสุดลงไม่ว่าจะโดยการบอกเลิกสัญญา หรือครบอายุสัญญา
          ผู้เช่าต้องนำคอมพิวเตอร์กลับคืนไปภายใน 3 วัน
          นับถัดจากวันที่สัญญาสิ้นสุดลง
          โดยผู้เช่าเป็นผู้เสียค่าใช้จ่ายเองทั้งสิ้น
          <br />
          <br />
          ข้อ ๑๑ การโอนกรรมสิทธิ์ให้บุคคลอื่น
          <br />
          <br />
          ในระหว่างอายุสัญญาเช่า
          ผู้ให้เช่าจะไม่โอนกรมสิทธิ์ในคอมพิวเตอร์ที่ให้เชาแก่บุคคลอื่นหากผู้ให้เช่าฝ้าฝืน
          ผู้ให้เช่ายินยอมชดใช้ค่าเสียหายให้แก่ผู้เช่า
          <br />
          <br />
          ข้อ ๑๒ การโอนสิทธิและหน้าที่ตามสัญญา
          <br />
          <br />
          ผู้ให้เช่าจะไม่โอนสิทธิและหน้าที่ที่มีต่อผู้เช่าตามสัญญานี้ให้แก่บุคคลอื่นโดยไม่ได้รับความเห็นชอบเป็นหนังสือจากผู้เช่าก่อน
        </div>
      </div>

      {/* bottom */}
      <div className="sticky pb-8 bottom-0 h-24 z-40 bg-[#f1f6f9] lg:w-2/3 lg:pr-[5%] flex justify-between items-end ">
        <Link href="/checkout/cart" className="font-bold text-slate-400">
          &lt; Return To Cart
        </Link>
        <Link
          href="/checkout/payment"
          className="transition ease-in-out delay-150 duration-200 hover:scale-110 cursor-pointer text-white bg-[color:var(--theme-color2)] w-48 uppercase font-bold rounded-full h-12 flex justify-center items-center gap-2"
        >
          Next
        </Link>
      </div>
    </div>
  );
}
export default Contract;
